[
  {
    "id": "VM_001_001_20250820",
    "title": "INVITATION FOR EXPRESSION OF INTEREST FOR A CONSULTANT TO DEVELOP VIRAL HEPATITIS B AND C GUIDELINES",
    "company": "Zimbabwe Technical Assistance, Training and Education Center for Health (Zim-TTECH)",
    "description": "Title: Consultant for Developing Viral Hepatitis B and C Guidelines Duration: Three months Deadline for Receipt of Expressions: 19 December 2024 Background The Ministry of Health and Child Care (MOHCC) in Zimbabwe is seeking a qualified consultant to develop comprehensive guidelines for the prevention, testing, treatment, and care of Viral",
    "category": "Education & Training",
    "sourceSite": "VacancyMail",
    "applyEmail": "hbvconsultant@zimttech.org",
    "closingDate": "Expires 20 Dec 2025"
  },
  {
    "id": "VM_001_002_20250820",
    "title": "Instore Counter Sales Reps",
    "company": "N/A",
    "description": "Description A fast growing company in the motor spares distribution and retail business is seeking the services of Instore Counter sales reps to be based in Harare, Mutare, Gweru, Chivhu and Bulawayo",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "salesvacancies62022@gmail.com",
    "closingDate": "Expires 18 Dec 2025"
  },
  {
    "id": "VM_001_003_20250820",
    "title": "Marketing Officer",
    "company": "The Customer Experience Association of Zimbabwe (CXAZ)",
    "description": "WE ARE LOOKING FOR A MARKETING OFFICER TO JOIN OUR VIBRANT TEAM IN HARARE Description The incumbent will be reporting to the Sales and Marketing Manager.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "aquiline@exaz.org",
    "closingDate": "Expires 15 Dec 2025"
  },
  {
    "id": "VM_001_004_20250820",
    "title": "Socio-Economic Strengthening Officer",
    "company": "Family AIDS Caring Trust - FACT",
    "description": "FACT Zimbabwe is a Christian based organisation that was instituted in 1987. Since establishment, FACT Zimbabwe has been a leading national HIV and development organisation implementing various projects directly and through partnerships. The organization have since grown to become a broad-based health and development organization whilst maintaining special focus on",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 15 Dec 2025"
  },
  {
    "id": "VM_001_005_20250820",
    "title": "Service Providers and Suppliers Registration",
    "company": "Corporate 24 Hospital Group",
    "description": "Applications are invited from interested, reputable and prospective suppliers of goods and services to register as approved suppliers and service providers for the year 2025 for Corporate 24 Hospital along J.Tongogara Street between 8th and 9th Avenue Bulawayo. Suppliers will be required for the following product and service categories:",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 13 Dec 2025"
  },
  {
    "id": "VM_001_006_20250820",
    "title": "INVITATION TO TENDER TENDER FOR CONSULTANCY FOR PRIVATE SECTOR & FINANCIAL INSTITUTION ENGAGEMENT AND BEST PROJECT SCALE PROPOSAL DEVELOPMENT",
    "company": "World Vision",
    "description": "World Vision Registration No. PVO 26 /79 INVITATION TO TENDER TENDER FOR CONSULTANCY FOR PRIVATE SECTOR & FINANCIAL INSTITUTION ENGAGEMENT AND BEST PROJECT SCALE PROPOSAL DEVELOPMENT World Vision Zimbabwe (WVZ) is inviting reputable individuals/organizations to submit bids for consultancy services to support the Resource Development and Donor Engagement (RDDE) in",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "wvzprocurement-harare@wvi.org",
    "closingDate": "Expires 13 Dec 2025"
  },
  {
    "id": "VM_001_007_20250820",
    "title": "Expression of Interest :  Invitation for Partnership",
    "company": "Trcaire",
    "description": "Expression of Interest Invitation for Partnership Trcaire has been supporting projects in Zimbabwe since the 1970's. Informed by our global strategy, our current country programme works in 4 main areas: 1) Supporting Women and Girls' Protection, Voice, and Leadership, 2) Climate and Environmental Justice 3) Active Citizenship and Access to",
    "category": "Security",
    "sourceSite": "VacancyMail",
    "applyEmail": "infozimbabwe@trocaire.org",
    "closingDate": "Expires 11 Dec 2025"
  },
  {
    "id": "VM_001_008_20250820",
    "title": "Nurse Counsellor - Cimas Ruwa Clinic",
    "company": "CIMAS",
    "description": "Job Summary Cimas Health Group's purpose is to inspire healthier communities by providing global standard health and wellness solutions. In pursuant to this purpose, Cimas is searching for a Nurse Counsellor to join the organization and provide nursing services to patients in line with Cimas policies, procedures and professional standards.",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "cimasrecruitment@cimas.co.zw",
    "closingDate": "Expires 09 Dec 2025"
  },
  {
    "id": "VM_001_009_20250820",
    "title": "Marketing Interns",
    "company": "Munch Zimbabwe",
    "description": "Munch Zimbabwe is looking for marketing interns",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 08 Dec 2025"
  },
  {
    "id": "VM_001_010_20250820",
    "title": "Bikers",
    "company": "Munch Zimbabwe",
    "description": "Munch Zimbabwe for bikers with own bikes",
    "category": "Other",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 07 Dec 2025"
  },
  {
    "id": "VM_002_001_20250820",
    "title": "Injection Mold  Operator",
    "company": "N/A",
    "description": "INJECTION MOLD OPERATOR REPORTS TO PRODUCTION SUPERVISOR JOB SUMMARY A manufacturing organization is looking to engage a qualified and experienced person. The position requires an individual with experience in the plastics manufacturing industry. As the organization has aggressive expansion plans, we require a high calibre, proven experience in running plastic",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "denverrecruit1224@gmail.com",
    "closingDate": "Expires 06 Dec 2025"
  },
  {
    "id": "VM_002_002_20250820",
    "title": "CALL FOR EXPRESSION OF INTEREST FOR CONSULTANCY SERVICES FOR THE DESIGN AND IMPLEMENTATION OF A CAPACITY DEVELOPMENT PROGRAM FOR SIMUKAI CHILD PROTECTION PROGRAMME",
    "company": "Simukai Child Protection Program",
    "description": "Simukai Child Protection Programme (PVO27/12) (http://www.simukaicpp.org.zw)is a multi-service Organization that provides a range of child and youth-based programs for the community. It was established to serve children and youths in a holistic and inclusive manner based on the Eco-systemic child rights approach. The Organization also empowers children, young people and",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "peterc@simukaicpp.org.zw",
    "closingDate": "Expires 05 Dec 2025"
  },
  {
    "id": "VM_002_003_20250820",
    "title": "DENTAL NURSE (Sponsored Trainee), AVENUES + BORROWDALE BASED",
    "company": "DOMBOSHAVA MEDCLINIC",
    "description": "1. Digital Proficiency: Strong command of internet essentials, proven secretarial skills, and demonstrated computer literacy are required. 2. Front Office and Public Relations: Responsible for reception duties and maintaining a professional public image for the organisation. 3. Stakeholder Communication: Handle communication with external partners, clients, and stakeholders in a courteous",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 02 Nov 2025"
  },
  {
    "id": "VM_002_004_20250820",
    "title": "Sales Officer",
    "company": "Corporate 24 Hospital Group",
    "description": "Our organization is growing and we are looking for a dynamic and results-driven Sales Officer to join our team.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@corp24med.com",
    "closingDate": "Expires 30 Sep 2025"
  },
  {
    "id": "VM_002_005_20250820",
    "title": "Systems Administrator",
    "company": "Traversal Trading",
    "description": "The System Administrator will be responsible for managing and maintaining the company's IT systems, ensuring security, availability, and efficiency.",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Sep 2025"
  },
  {
    "id": "VM_002_006_20250820",
    "title": "Skip Truck Driver",
    "company": "Geo Pomona Waste Management",
    "description": "A skip truck driver is responsible for the safe transportation of empty and full skip bins to and from designated locations. This includes maneuvering the truck, securing loads, and ensuring timely deliveries according to schedules. They also handle waste disposal, potentially at nominated waste disposal centers, and may be involved",
    "category": "Transportation & Logistics",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 17 Sep 2025"
  },
  {
    "id": "VM_002_007_20250820",
    "title": "Foreman (Diesel Plant Fitter)",
    "company": "Geo Pomona Waste Management",
    "description": "We are looking for a highly organized and experienced Foreman to oversee the maintenance and repair operations of our company's vehicle fleet. The Foreman is responsible for ensuring that all vehicles are operating safely, efficiently, and in compliance with all relevant regulations. This role involves managing a team of mechanics",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 17 Sep 2025"
  },
  {
    "id": "VM_002_008_20250820",
    "title": "Tipper Truck Driver",
    "company": "Geo Pomona Waste Management",
    "description": "Dump truck drivers transport paving materials, construction supplies, dirt, or garbage to and from various locations. They drive trucks equipped with open beds that allow for the transportation of dirt, rocks, sand, coal, or gravel.",
    "category": "Transportation & Logistics",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 17 Sep 2025"
  },
  {
    "id": "VM_002_009_20250820",
    "title": "Sweeper Truck Operator",
    "company": "Geo Pomona Waste Management",
    "description": "Responsible for the operation of street sweeping truck to maintain cleanliness in urban areas. This role involves ensuring that streets, sidewalks, and public spaces are free of waste and litter, contributing to the overall visible and hygiene of the community.",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 17 Sep 2025"
  },
  {
    "id": "VM_002_010_20250820",
    "title": "Concrete Mixer Truck Driver & Operator",
    "company": "Geo Pomona Waste Management",
    "description": "The Concrete Mixer Truck Driver and Operator is responsible for the safe and efficient operation of the concrete mixer truck to deliver ready-mix concrete to various construction sites. The role involves driving, operating the mixing equipment, ensuring proper handling of concrete, and maintaining the vehicle in compliance with company and",
    "category": "Transportation & Logistics",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 17 Sep 2025"
  },
  {
    "id": "VM_003_001_20250820",
    "title": "Receptionist",
    "company": "N/A",
    "description": "We are seeking a highly motivated, energetic, and professional Receptionist who is not only the face of M&J Africa but also contributes to business growth. The ideal candidate will combine strong communication and interpersonal skills with a passion for sales, teamwork, and continuous learning.",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 15 Sep 2025"
  },
  {
    "id": "VM_003_002_20250820",
    "title": "Salesperson",
    "company": "N/A",
    "description": "We are looking for a results-driven Sales Person with experience in preparing tender documents and bids to join our growing team. The ideal candidate will combine strong sales acumen with meticulous attention to detail in tender preparation and submission.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 14 Sep 2025"
  },
  {
    "id": "VM_003_003_20250820",
    "title": "Accountant",
    "company": "N/A",
    "description": "We are recruiting, on behalf of our client in the construction industry, a detail-oriented and highly organized Accountant to join their finance team. The ideal candidate will have a strong background in reconciliations, taxation, and preparation of financial statements, with experience in construction or retail being a significant advantage.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 14 Sep 2025"
  },
  {
    "id": "VM_003_004_20250820",
    "title": "French Teacher",
    "company": "N/A",
    "description": "Curriculum Delivery: Instruct students in French language, literature, and culture, adhering to the Cambridge curriculum framework. Lesson Planning and Delivery: Develop and implement engaging and effective lesson plans that cater to diverse learning styles. Assessment and Feedback: Assess student learning through various methods, provide feedback on their progress, and communicate",
    "category": "Education & Training",
    "sourceSite": "VacancyMail",
    "applyEmail": "schoolrecruitment2022@gmail.com",
    "closingDate": "Expires 14 Sep 2025"
  },
  {
    "id": "VM_003_005_20250820",
    "title": "Salesperson",
    "company": "N/A",
    "description": "We are looking for a results-driven Sales Person with experience in preparing tender documents and bids to join our growing team. The ideal candidate will combine strong sales acumen with meticulous attention to detail in tender preparation and submission.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 14 Sep 2025"
  },
  {
    "id": "VM_003_006_20250820",
    "title": "Business Development Manager",
    "company": "Geo Pomona Waste Management",
    "description": "As a business development manager, you'll identify new business opportunities in Waste Management in order to generate revenue, improve profitability and help the business grow through strategic service provision to potential, and existing clients. As a business development personnel you should poses a thorough understanding of our services, our intended",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 13 Sep 2025"
  },
  {
    "id": "VM_003_007_20250820",
    "title": "Waste Collection Manager",
    "company": "Geo Pomona Waste Management",
    "description": "Waste Collection Manager is responsible for ensuring that waste is collected safely and in compliance with environmental standards. They also manage the waste collection team and develop and implement waste collection plans.",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@geopomona.com",
    "closingDate": "Expires 13 Sep 2025"
  },
  {
    "id": "VM_003_008_20250820",
    "title": "Property sales agents",
    "company": "N/A",
    "description": "We are recruiting on behalf of our client for a professional, driven, and customer-focused Property Sales Agent who is passionate about real estate and thrives in a client-facing role. This position is perfect for someone who enjoys building relationships, showcasing properties, and closing deals. You'll be responsible for actively promoting",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 11 Sep 2025"
  },
  {
    "id": "VM_003_009_20250820",
    "title": "Brand and Content Specialist",
    "company": "Webdev Group",
    "description": "Join Our Team! Brand & Content Specialist Are you passionate about fintech storytelling, digital marketing, and brand building? Paynow is looking for a creative Brand and Content Specialist to help shape and grow a powerful brand presence across Zimbabwe and beyond.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 10 Sep 2025"
  },
  {
    "id": "VM_003_010_20250820",
    "title": "Receptionist",
    "company": "N/A",
    "description": "An excellent oppoturnity for a young and vibrant professional to work in an awesome and collaboratibve environement supporting the team with top of the class client services support!",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitments20245@gmail.com",
    "closingDate": "Expires 08 Sep 2025"
  },
  {
    "id": "VM_004_001_20250820",
    "title": "Regional Technical Senior Specialist - Conflict",
    "company": "Chemonics FEWS NET",
    "description": "Scope of Work Introduction The Famine Early Warning Systems Network (FEWS NET) is an integrated set of activities funded by the United States Government (USG) and is intended to provide timely, accurate, evidence-based, and transparent food insecurity early warning information and analysis. Created in 1985 in response to famines in",
    "category": "Consulting",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 08 Sep 2025"
  },
  {
    "id": "VM_004_002_20250820",
    "title": "Social Media Marketing Person",
    "company": "N/A",
    "description": "The School Social Media Marketing Personnel is responsible for developing and implementing the school's social media strategy to promote its brand, engage with the school community (prospective and current students, parents, alumni, and staff), and support admissions and communication goals. This role requires a strong understanding of various social media",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "schoolrecruitment2022@gmail.com",
    "closingDate": "Expires 07 Sep 2025"
  },
  {
    "id": "VM_004_003_20250820",
    "title": "CALL FOR EXPRESSION OF INTEREST TO HOST SIDE SESSIONS AT #ZAMI25",
    "company": "Zimbabwe Environmental Law Association (ZELA)",
    "description": "Theme: From extraction to sustainable development: unlocking Zimbabwe's mineral wealth for inclusive growth in the just energy transition. BACKGROUND Zimbabwe Coalition on Debt and Development (ZIMCODD), Zimbabwe Council of Churches (ZCC) & Zimbabwe Environmental Law Association (ZELA) are seeking expressions of interest to host half-day side sessions at the 13th",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "joyce@zela.org",
    "closingDate": "Expires 07 Sep 2025"
  },
  {
    "id": "VM_004_004_20250820",
    "title": "GENERAL HAND",
    "company": "Hammer and Tongues Africa Holdings",
    "description": "Cleaning, Washing and Preparing meals",
    "category": "Other",
    "sourceSite": "VacancyMail",
    "applyEmail": "zimexecposts2030@gmail.com",
    "closingDate": "Expires 05 Sep 2025"
  },
  {
    "id": "VM_004_005_20250820",
    "title": "Sales Representative",
    "company": "N/A",
    "description": "On behalf of our client, we are recruiting for the position of Sales Representative. We are seeking a driven and results-oriented individual to join their team. The successful candidate will be responsible for identifying potential clients, making cold calls, following up on leads, conducting client meetings, preparing proposals, and delivering",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 04 Sep 2025"
  },
  {
    "id": "VM_004_006_20250820",
    "title": "CALL FOR EXPRESSION OF INTEREST : Support to private sector for development and launch of products based on traditional ingredients",
    "company": "Bio-Innovation Zimbabwe (BIZ)",
    "description": "CALL FOR EXPRESSION OF INTEREST Support to private sector for development and launch of products based on traditional ingredients Deadline: 3 September 2025, 5pm This is a call to support work under the BMZ-funded Building inclusive, diverse and quality food systems in Mudzi and Rushinga districts (Pundutso) project, implemented by",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 03 Sep 2025"
  },
  {
    "id": "VM_004_007_20250820",
    "title": "ICT TECHNICIAN (1 post)",
    "company": "Zimbabwe Ezekiel Guti University",
    "description": "Zimbabwe Ezekiel Guti University (ZEGU) is inviting suitably qualified personnel to fill in the following post:",
    "category": "Human Resources",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@zegu.ac.zw",
    "closingDate": "Expires 03 Sep 2025"
  },
  {
    "id": "VM_004_008_20250820",
    "title": "Electrical Engineer - Events Company",
    "company": "Prime Talent Solutions",
    "description": "Location: Harare Our client is a leading events planning company specializing in large-scale concerts, festivals, corporate events, and exhibitions. With a focus on delivering seamless, innovative experiences, they are committed to creating unforgettable moments for audiences and clients alike. They are currently seeking a skilled Electrical Engineer to join their",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@pts.co.zw",
    "closingDate": "Expires 01 Sep 2025"
  },
  {
    "id": "VM_004_009_20250820",
    "title": "Wages Clerk",
    "company": "N/A",
    "description": "Wages Clerk wanted",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "nikkisamjones@gmail.com",
    "closingDate": "Expires 01 Sep 2025"
  },
  {
    "id": "VM_004_010_20250820",
    "title": "A'Level Business Studies & Economics Teacher",
    "company": "N/A",
    "description": "Are you a passionate educator with a strong background in Business Studies and Economics? Join our vibrant team at a leading institution in Harare dedicated to academic excellence and holistic development. Position Available: Advanced Level Business Studies & Economics Teacher",
    "category": "Education & Training",
    "sourceSite": "VacancyMail",
    "applyEmail": "academyhre@gmail.com",
    "closingDate": "Expires 01 Sep 2025"
  },
  {
    "id": "VM_005_001_20250820",
    "title": "BURSAR",
    "company": "ZIMCARE TRUST",
    "description": "The Bursar is responsible for professional handling of all finances at the centre, submitting returns and preparing all books for both internal and external audit.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "zimcarerecruitment@gmail.com",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_002_20250820",
    "title": "Auto Mechanic",
    "company": "N/A",
    "description": "A new division in an established company is seeking to employ full time on-site auto mechanics who will be stationed at a fitment centre.",
    "category": "Other",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr.cardence@gmail.com",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_003_20250820",
    "title": "Mine Surveyor",
    "company": "Zimasco (Pvt) Limited",
    "description": "VACANCY NOTICE Zimasco (Pvt) Limited, a major player in Zimbabwe's Ferrochrome sector, has an exciting and challenging career opportunity within its Shurugwi & South Dyke Mining Division. Applications are invited from suitably qualified, competent and experienced individuals to fill the vacant posts of Mine Surveyor on a 3 years Fixed-Term",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@zimasco.co.zwCLOSING",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_004_20250820",
    "title": "SENIOR NURSE AIDE (PA/Secretary) to NURSING MATRON",
    "company": "DOMBOSHAVA MEDCLINIC",
    "description": "1. Internet essentials 2. Reception duties 3. Communication with external stakeholders 4. Hospital secretarial duties 5. Minute taking 6. Assist the Midwife as a senior nurse aide 7. Assist the dentist during clinical work. 8. AODs as directed by Matron This is not a position for chancers. Only those who",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_005_20250820",
    "title": "Procurement and logistics officer",
    "company": "Plus Five Pharmaceuticals",
    "description": "As a Procurement And Logistics Officer, you will be responsible for managing the procurement of raw materials, supplies, and equipment, as well as coordinating logistics and supply chain operations to ensure timely and efficient delivery of products. This is an urgent requirement, and the successful candidate will be expected to",
    "category": "Transportation & Logistics",
    "sourceSite": "VacancyMail",
    "applyEmail": "pplusfivehealthcare01@gmail.comCc",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_006_20250820",
    "title": "Group Managing Director",
    "company": "N/A",
    "description": "Group Managing Director",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment.miningzimbabwe@gmail.com",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_007_20250820",
    "title": "Sales Agents: MicroMed",
    "company": "First Mutual Holdings Limited",
    "description": "We're Hiring Sales Agents Job description We are seeking motivated sales agents to sell our health insurance product in the following cities: 1. Harare 2. Bulawayo 3. Gweru 4. Masvingo 5. Mutare 6. Zvishavane 7. Beitbridge 8. Kadoma 9. Chinhoyi",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "MicromedFMHC@firstmutual.co.zw",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_008_20250820",
    "title": "Group Project Management Administrator",
    "company": "N/A",
    "description": "Group Project Management Administrator",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment.miningzimbabwe@gmail.com",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_009_20250820",
    "title": "Guest House Manager",
    "company": "Hilton Transfers International",
    "description": "Job Title: Guest House Manager (Harare & Bulawayo) Location: Harare & Bulawayo (Dual-Site Management) Employment Type: Full-Time About the Role: We are seeking a dynamic and results-driven *Guest House Manager* to oversee operations at our Harare and Bulawayo guest houses. The ideal candidate will be responsible for driving sales, ensuring",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "accounts@hiltontransfers.com",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_005_010_20250820",
    "title": "DENTAL & MEDICAL SURGERY ASSISTANT/NURSE AIDE ATTACHEE",
    "company": "DOMBOSHAVA MEDCLINIC",
    "description": "This is not a position for chancers. Only those who comply with minimum listed requirements can apply. What is a dental surgery assistant? This is a trainee position not a job offer. During and after training your responsibilities may include preparing patients and the operating room for the dentist. You",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_006_001_20250820",
    "title": "Sales Agents: MicroMed",
    "company": "First Mutual Holdings Limited",
    "description": "We're Hiring Sales Agents Job description We are seeking motivated sales agents to sell our health insurance product in the following cities: 1. Harare 2. Bulawayo 3. Gweru 4. Masvingo 5. Mutare 6. Zvishavane 7. Beitbridge 8. Kadoma 9. Chinhoyi",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "MicromedFMHC@firstmutual.co.zw",
    "closingDate": "Expires 31 Aug 2025"
  },
  {
    "id": "VM_006_002_20250820",
    "title": "Telesales Representative - Pharmaceutical and Beauty Care Products",
    "company": "Plus Five Pharmaceuticals",
    "description": "As a Telesales Representative, you will be responsible for selling our range of pharmaceutical and beauty care products to our target market via telephone. You will build relationships with customers, identify new sales opportunities, and achieve sales targets.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "pplusfivehealthcare01@gmail.com",
    "closingDate": "Expires 30 Aug 2025"
  },
  {
    "id": "VM_006_003_20250820",
    "title": "INTERNS- SALES AND MARKETING / SUPPLY CHAIN MANAGEMENT",
    "company": "Nash Paints",
    "description": "Nash Paints is looking for Sales and Marketing/ Supply Chain Management Attachees to join their organization.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 30 Aug 2025"
  },
  {
    "id": "VM_006_004_20250820",
    "title": "Van sales representatives",
    "company": "Plus Five Pharmaceuticals",
    "description": "A leading distributor of pharmaceutical and beauty care products in Zimbabwe. We are seeking a skilled and experienced Van Sales Representative to join our team and drive sales growth to supermarkets, pharmacies, and shops in Harare and the surrounding provinces. As a Van Sales Representative, you will be responsible for",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "pplusfivehealthcare01@gmail.com",
    "closingDate": "Expires 30 Aug 2025"
  },
  {
    "id": "VM_006_005_20250820",
    "title": "Web & Graphic Designer",
    "company": "N/A",
    "description": "We are looking for a talented individual who not only has a strong aesthetic sense but also possesses robust technical skills in website development, specifically with WordPress and Elementor. This role is perfect for a self-motivated learner who is passionate about creating seamless and engaging digital experiences. You will be",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "tohr@mjconsultancy.co.zw",
    "closingDate": "Expires 30 Aug 2025"
  },
  {
    "id": "VM_006_006_20250820",
    "title": "Till Operators and Shop Assistants",
    "company": "Southsea Investments Pvt Ltd",
    "description": "Are you passionate about retail and looking for a rewarding career? We are a leading retail company committed to excellence, customer satisfaction, and employee growth. We are currently hiring for multiple positions across various departments. If you have the skills, experience, and enthusiasm to thrive in a fast-paced retail environment,",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "opportunities@spar.co.zw",
    "closingDate": "Expires 30 Aug 2025"
  },
  {
    "id": "VM_006_007_20250820",
    "title": "Office Junior Cook",
    "company": "Traversal Trading",
    "description": "The incumbent will be responsible for preparing daily meals for employees at the office premises, ensuring cleanliness, hygiene, and timely service",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_006_008_20250820",
    "title": "Quantity Surveyor",
    "company": "Traversal Trading",
    "description": "As a Quantity Surveyor, your primary responsibility is to manage and control the costs associated with construction projects. You will work closely with architects, engineers, contractors, and other stakeholders to ensure that projects are completed within budget while maintaining quality standards. Your expertise in cost estimation, project evaluation, and contract",
    "category": "Consulting",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_006_009_20250820",
    "title": "STORE BUYER",
    "company": "Southsea Investments Pvt Ltd",
    "description": "An exciting opportunity has arisen for suitably qualified and self-driven individuals in one of the leading FMCG in Zimbabwe to fill in the position of a Store Buyer. The role entails ensuring 100% availability of the store's stock through establishing dependable supply sources and purchase products to the store's exact",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@southsea.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_006_010_20250820",
    "title": "Junior Quantity Surveyor",
    "company": "Traversal Trading",
    "description": "As a Quantity Surveyor, your primary responsibility is to manage and control the costs associated with construction projects. You will work closely with architects, engineers, contractors, and other stakeholders to ensure that projects are completed within budget while maintaining quality standards. Your expertise in cost estimation, project evaluation, and contract",
    "category": "Consulting",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_001_20250820",
    "title": "Junior Quantity Surveyor",
    "company": "Traversal Trading",
    "description": "As a Quantity Surveyor, your primary responsibility is to manage and control the costs associated with construction projects. You will work closely with architects, engineers, contractors, and other stakeholders to ensure that projects are completed within budget while maintaining quality standards. Your expertise in cost estimation, project evaluation, and contract",
    "category": "Consulting",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_002_20250820",
    "title": "Primary School Teacher",
    "company": "N/A",
    "description": "Our school seeks a qualified and dedicated Primary School Teacher to join our academic staff for the Third term 2025. The successful candidates will be responsible for delivering high-quality instruction in all core subjects, fostering a positive and productive learning environment, and assessing student progress effectively. We are looking for",
    "category": "Education & Training",
    "sourceSite": "VacancyMail",
    "applyEmail": "schoolrecruitment2022@gmail.com",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_003_20250820",
    "title": "Finance and Administration Manager",
    "company": "Traversal Trading",
    "description": "Oversee the Finance and Administration function and ensure seamless integration of all systems, processes, and procedures.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_004_20250820",
    "title": "Office Junior Cook",
    "company": "Traversal Trading",
    "description": "The incumbent will be responsible for preparing daily meals for employees at the office premises, ensuring cleanliness, hygiene, and timely service",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_005_20250820",
    "title": "Senior Program Manager: Climate, Environment and Health  (Mt Darwin/ Harare)",
    "company": "CeSHHAR Zimbabwe",
    "description": "CeSHHAR Zimbabwe is an organisation that specialises in population health research and programming, including on sexual and reproductive health and HIV/AIDS. CeSHHAR has an extensive national, regional, and international academic and community partnership network. CeSHHAR has a diverse range of funders which include the Wellcome Trust, Gates Foundation, United States",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "vacancies@ceshhar.org",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_006_20250820",
    "title": "Social Media Officer",
    "company": "Traversal Trading",
    "description": "The incumbent will support the marketing and communications function by managing online presence, engaging audiences, and promoting the company's services and products.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_007_20250820",
    "title": "Irrigation Technician",
    "company": "Traversal Trading",
    "description": "The Irrigation Technician will install, maintain, and repair irrigation systems for landscaping, construction sites, and agricultural projects.",
    "category": "Agriculture",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_008_20250820",
    "title": "Technical Business Development Officer",
    "company": "Traversal Trading",
    "description": "The role is responsible for driving sales of construction materials (industrial pipes, hardware, and related products) and securing new business opportunities in the construction sector.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@traversal.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_009_20250820",
    "title": "Cashier",
    "company": "N/A",
    "description": "We are seeking a vibrant and customer-focused Cashier to join our client's team in Chiredzi. The ideal candidate should not only be efficient in handling transactions but also have a strong sales background and excellent upselling skills. A positive attitude, the ability to smile and engage warmly with customers, and",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_007_010_20250820",
    "title": "NURSE ANAESTHETIST X1 - ZVISHAVANE",
    "company": "Cell Insurance Group",
    "description": "Applications are invited from suitably qualified and experienced candidates to fill the position of RGN-Anaesthetist that has arisen at Nectacare Private Limited in Zvishavane.",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@cellinsurance.co.zw",
    "closingDate": "Expires 29 Aug 2025"
  },
  {
    "id": "VM_008_001_20250820",
    "title": "Transport Officer",
    "company": "N/A",
    "description": "We are looking for an energetic, motivated and detail oriented transport officer to work in the private security industry Duties and responsibilities: Job summary Seeking a transport officer to work in the private security industry. This role plays a vital for supporting the transport departments",
    "category": "Transportation & Logistics",
    "sourceSite": "VacancyMail",
    "applyEmail": "trnsprtofficer@gmail.com",
    "closingDate": "Expires 28 Aug 2025"
  },
  {
    "id": "VM_008_002_20250820",
    "title": "Sound Engineer",
    "company": "N/A",
    "description": "Sound Engineer Wanted We're seeking a talented Sound Engineer to join our dynamic team.",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "engineersound28@gmail.com",
    "closingDate": "Expires 28 Aug 2025"
  },
  {
    "id": "VM_008_003_20250820",
    "title": "Sales and Marketing Officer",
    "company": "N/A",
    "description": "We are recruiting on behalf of our client for a dynamic and results-driven Sales & Marketing Officer. This is an exciting opportunity for a mature and experienced individual who is passionate about sales and marketing, and eager to drive business growth through client acquisition, brand visibility, and market development in",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 28 Aug 2025"
  },
  {
    "id": "VM_008_004_20250820",
    "title": "Sales Person",
    "company": "N/A",
    "description": "We are Hiring!  Sales Person",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "brrecruitment2025@gmail.com",
    "closingDate": "Expires 28 Aug 2025"
  },
  {
    "id": "VM_008_005_20250820",
    "title": "MARKETING AND EVENTS OFFICER",
    "company": "Contact Centre Association of Zimbabwe",
    "description": "Are you passionate about enhancing customer experiences and driving impactful marketing strategies? We are seeking a motivated *Marketing and Events Officer* to join our dynamic team! - Be part of a forward-thinking organisation dedicated to improving customer experiences. - Work in a collaborative and supportive environment. - Enjoy opportunities for",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "cxazjobs@gmail.com",
    "closingDate": "Expires 27 Aug 2025"
  },
  {
    "id": "VM_008_006_20250820",
    "title": "Radiographer - Bulawayo *3, Harare *3 (Part-time)",
    "company": "Population Solutions for Health",
    "description": "The Radiographer is responsible for providing radiography services and assisting in the diagnosis of lung health conditions at the New Start Centre clinic and during outreach. The role involves preparing patients for chest X-ray, operating the ultraportable CAD4TB equipment, maintaining the equipment and ensuring accurate data collection, and interpretation of",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@psh.org.zw",
    "closingDate": "Expires 27 Aug 2025"
  },
  {
    "id": "VM_008_007_20250820",
    "title": "Outreach Workerx1, Mutare",
    "company": "CeSHHAR Zimbabwe",
    "description": "CeSHHAR Zimbabwe is an organisation that specialises in population health research and programming, including on sexual and reproductive health and HIV/AIDS. CeSHHAR has an extensive national, regional, and international academic and community partnership network. CeSHHAR has a diverse range of funders which include the Wellcome Trust, the Gates Foundation, UK",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "vacancies@ceshhar.co.zw",
    "closingDate": "Expires 27 Aug 2025"
  },
  {
    "id": "VM_008_008_20250820",
    "title": "Commission-Based Direct Sales Agent for a Microfinance Bank",
    "company": "N/A",
    "description": "To drive customer acquisition for Bank's loan and deposit products by sourcing clients from government institutions, private companies, and village communities within designated branch jurisdictions. The DSA is responsible for marketing bank products, collecting applications, and forwarding them to the branch for processing. This is a commission-based role, with earnings",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 26 Aug 2025"
  },
  {
    "id": "VM_008_009_20250820",
    "title": "SALES REPRESENTATIVE",
    "company": "N/A",
    "description": "We are seeking a young, energetic, and enthusiastic Sales Representative aged between 19 and 21 years, who is quick to learn and confident in speaking to clients. The ideal candidate should possess strictly O' and A' Level qualifications and be passionate about sales, customer service, and building long-term client relationships.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@mjconsultants.co.zw",
    "closingDate": "Expires 26 Aug 2025"
  },
  {
    "id": "VM_008_010_20250820",
    "title": "Communications Intern",
    "company": "N/A",
    "description": "Hospice and Palliative Care Association of Zimbabwe (HOSPAZ)PVO13/99, is a member-based organization registered in 1999 as a Private Voluntary Organization responsible for coordinating and building the capacity of organizations that provide and support palliative care and home care in Zimbabwe. The organization seeks to engage a highly motivated and creative",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "information@hospaz.co.zw",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_001_20250820",
    "title": "Sales &Marketing Representative",
    "company": "Wovenstars",
    "description": "Applications are invited from suitably qualified and experienced persons to fill in the position of a Sales and Marketing Representative responsible for building and maintaining customer relationships, tracking sales data and producing performance reports.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@prodex.co.zw",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_002_20250820",
    "title": "Caretaker",
    "company": "Avondale Primary",
    "description": "JOB ADVERT: CARETAKER Position: Caretaker Location: Avondale Primary School Type: Full-time/Part-time About the Role: We are looking for a reliable Caretaker to maintain our school's facilities, ensuring a clean and safe environment for our students.",
    "category": "Education & Training",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_003_20250820",
    "title": "Administrator/Receptionist",
    "company": "N/A",
    "description": "We're Hiring! Medical Front Office Administrator/Receptionist Are you a highly organized and compassionate professional with experience in a medical setting? We're looking for a dedicated Medical Front Office Administrator to join our team at a busy medical practice in Harare. As the first point of contact for our patients, you'll",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "urolink19@gmail.com",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_004_20250820",
    "title": "Salesperson (Female) : RideSure Auto Imports",
    "company": "N/A",
    "description": "RideSure auto imports We're Hiring Salesperson (Female) We're looking for a motivated and dynamic Salesperson with a passion for sales and cars to join our motor vehicle import team.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "ridesurerecruitment@gmail.com",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_005_20250820",
    "title": "Communications Intern",
    "company": "N/A",
    "description": "Hospice and Palliative Care Association of Zimbabwe (HOSPAZ)PVO13/99, is a member-based organization registered in 1999 as a Private Voluntary Organization responsible for coordinating and building the capacity of organizations that provide and support palliative care and home care in Zimbabwe. The organization seeks to engage a highly motivated and creative",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "information@hospaz.co.zw",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_006_20250820",
    "title": "Loans Officers",
    "company": "N/A",
    "description": "Wildfin Microfinance is hereby looking for loans officers",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "humanresource@wildfinmicrofinance.co.zw",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_007_20250820",
    "title": "TRAINEE SECTION MANAGER X 1",
    "company": "Green Fuel",
    "description": "Applications are invited from suitably qualified individuals to fill the above vacancy that has arisen in the Fields Department. The successful incumbent(s) will undergo an intensive two-year graduate learnership program.",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "human.resources@ratingmiddlesabi.co.zw",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_008_20250820",
    "title": "Consultancy Opportunity: Data Mining, Analysis, and Production of Human Impact Stories on women's health for Policy Reform Advocacy",
    "company": "N/A",
    "description": "Background Women and Law in Southern Africa Zimbabwe (WLSA) is implementing the Enhancing Gender Responsiveness in Health Law and Policy in Zimbabwe (EGRHPZ) project. This initiative aims to improve access to maternal health rights for women and girls by advocating for gender-sensitive reforms in Zimbabwe's health laws, policies, and practices.",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "procurement315@gmail.com",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_009_20250820",
    "title": "Internal Auditor",
    "company": "National Biotechnology Authority",
    "description": "The National Biotechnology Authority is seeking a detail-oriented and proactive Internal Auditor to join our team. In this pivotal role, you will be responsible for evaluating our internal controls, compliance, and operational efficiency. The successful incumbent will help strengthen the Authority's financial integrity and ensure adherence to regulatory standards. Qualified",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "vacancies@nba.ac.zw",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_009_010_20250820",
    "title": "Network Support Technician",
    "company": "N/A",
    "description": "Location: Harare  Employment Type: Full-Time  Department: IT / Technical Support ---  Job Description We are looking for a proactive, solution-oriented IT professional to join our IT team at T.G. The successful candidate will play a critical role in ensuring our network infrastructure is stable, secure, and",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "talentsearch205@gmail.com",
    "closingDate": "Expires 25 Aug 2025"
  },
  {
    "id": "VM_010_001_20250820",
    "title": "Casual Driver Class 2",
    "company": "N/A",
    "description": "Persons wanted for casual/driver and must be 18 years and above",
    "category": "Transportation & Logistics",
    "sourceSite": "VacancyMail",
    "applyEmail": "marketing@proclassicgroup.com",
    "closingDate": "Expires 24 Aug 2025"
  },
  {
    "id": "VM_010_002_20250820",
    "title": "Call For Consultancy Services - Organizational Development  Staff Capacity Building Workshop",
    "company": "Adult RApe Clinic",
    "description": "The Adult Rape Clinic (ARC), is a specialised, survivor-centred service provider offering free medical and psychosocial support to survivors of sexual and gender-based violence (SGBV). Since its establishment in 2009, ARC has been at the forefront of delivering compassionate, confidential, and professional care while advocating for the prevention of SGBV",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "arcrecruitment2009@gmail.com",
    "closingDate": "Expires 24 Aug 2025"
  },
  {
    "id": "VM_010_003_20250820",
    "title": "Attach Digital Marketing Officer (Rusape)",
    "company": "Symdunes Financial Services",
    "description": "The Attach Digital Marketing Officer will be responsible for creating and executing digital marketing campaigns that increase brand awareness, generate leads, and convert passive audiences to active customers as well as identifying and pursuing business opportunities. The Attach Digital Marketing Officer will report to the Marketing Officer.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "cvsymdunes@gmail.com",
    "closingDate": "Expires 24 Aug 2025"
  },
  {
    "id": "VM_010_004_20250820",
    "title": "Sales Driver",
    "company": "TEECHERZ HOME AND OFFICE",
    "description": "Responsible for generating sales and delivering products to customers",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "mmcconsultancy24@gmail.com",
    "closingDate": "Expires 24 Aug 2025"
  },
  {
    "id": "VM_010_005_20250820",
    "title": "Sales and Marketing Attachment",
    "company": "N/A",
    "description": "Persons wanted for Sales and marketing attachment position in Mutare and must be 18 years and above.",
    "category": "Sales & Marketing",
    "sourceSite": "VacancyMail",
    "applyEmail": "marketing@proclassicgroup.com",
    "closingDate": "Expires 24 Aug 2025"
  },
  {
    "id": "VM_010_006_20250820",
    "title": "Driver",
    "company": "PELUM (Participatory Ecological Land Use Management Association)",
    "description": "Position:Driver Location:Harare, with frequent travel to various districts Type:Full-time, 1-year contract (renewable based on performance) Reports to:Finance and Administration Officer Organizational Background Participatory Ecological Land Use Management (PELUM) Zimbabwe is a programme of the Zimbabwe Institute of Permaculture (ZIP), structured as a network of primarily civil society organizations working to",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "pelumapps@gmail.com",
    "closingDate": "Expires 23 Aug 2025"
  },
  {
    "id": "VM_010_007_20250820",
    "title": "Accounting/Auditing student attachment",
    "company": "Rockstone Chartered Accountants",
    "description": "Accounting/Auditing student attachment",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@rockstone.co.zw",
    "closingDate": "Expires 23 Aug 2025"
  },
  {
    "id": "VM_010_008_20250820",
    "title": "INVITATION TO EXPRESS INTEREST",
    "company": "PELUM (Participatory Ecological Land Use Management Association)",
    "description": "SUBJECT: OPEN CALL FOR EXPRESSIONS OF INTEREST FOR CONSTRUCTION OF OFFICE SUPERSTRUCTURE. PELUM Zimbabwe is inviting qualified and experienced construction companies to submit Expressions of Interest (EOI) for the construction of the superstructure of its new office building, located in Mt. Hampden. Scope of Work",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "info@pelumzimbabwe.org",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_010_009_20250820",
    "title": "Attach Loans Officer (Chimanimani)",
    "company": "Symdunes Financial Services",
    "description": "The Attach Loan officer will evaluate, authorize approval or deny loan applications for people or for business, act as liaison between customers and our financial institution and help qualified applicants acquire loans in a timely manner. The Attach Loans Officer will report to the Senior Loans Officer.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "cvsymdunes@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_010_010_20250820",
    "title": "Consultancy Opportunity: Development of Issue Papers on Intersectional Gender-Based Violence (GBV) in Zimbabwe",
    "company": "N/A",
    "description": "1. Background Zimbabwe has made important strides in enacting legislation to address violence against women and girls (VAWG). However, significant implementation gaps persist, especially for women and girls facing multiple and intersecting forms of discrimination such as those living with disabilities, adolescent girls, women in rural areas, and women from",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "procurement315@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_001_20250820",
    "title": "Attach Loans Officer (Chimanimani)",
    "company": "Symdunes Financial Services",
    "description": "The Attach Loan officer will evaluate, authorize approval or deny loan applications for people or for business, act as liaison between customers and our financial institution and help qualified applicants acquire loans in a timely manner. The Attach Loans Officer will report to the Senior Loans Officer.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "cvsymdunes@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_002_20250820",
    "title": "Graduate Trainees- Stores",
    "company": "Isteel and Pump Solutions",
    "description": "We are looking for graduate trainees to work in our stores department",
    "category": "Other",
    "sourceSite": "VacancyMail",
    "applyEmail": "hrisp914@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_003_20250820",
    "title": "Nurse/Ambulance Technician",
    "company": "Jena Mines (Pvt) Ltd",
    "description": "We are seeking to recruit a Nurse/Ambulance Technician to join our team in the Human Resources department reporting to the Sister in Charge.",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@jenagold.co.zw",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_004_20250820",
    "title": "Consultancy Opportunity: Development of Terms of Reference for the National Working Group on Child Marriages",
    "company": "N/A",
    "description": "1. Background Child marriage remains a critical issue in Zimbabwe, with approximately 34% of girls married before the age of 18. Despite recent legislative reforms, including the enactment of the Marriages Act (Chapter 5:17), the practice persists due to a combination of socio-economic pressures, cultural and religious beliefs and gaps",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "procurement315@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_005_20250820",
    "title": "Consultancy Opportunity: Peer Reviewer",
    "company": "N/A",
    "description": "1. General Information The Women and Law in Southern Africa Research and Education Trust (WLSA) is a registered Private Voluntary Organization (PVO 16/2016) established in 1989 to enhance the sustained well-being of women and girls in Southern Africa. Operating in Zimbabwe, Zambia, Botswana, Malawi, Lesotho, Swaziland (Eswatini), and Mozambique, WLSA",
    "category": "Consulting",
    "sourceSite": "VacancyMail",
    "applyEmail": "procurement315@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_006_20250820",
    "title": "Farm Production Managers X2",
    "company": "Green Feathers Farm Pvt Ltd",
    "description": "We are a diversified agricultural business located in the heart of Wedza district, just 120 km southeast of Harare. Our main pillars of production are horticulture, cereals & tobacco, livestock and agro tourism. Are you passionate about agriculture, innovation, and making a positive impact? We are seeking talented and experienced",
    "category": "Agriculture",
    "sourceSite": "VacancyMail",
    "applyEmail": "gffvacancy@gmail.comSubject",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_007_20250820",
    "title": "Consultancy Opportunity: Development of Issue Papers on Intersectional Gender-Based Violence (GBV) in Zimbabwe",
    "company": "N/A",
    "description": "1. Background Zimbabwe has made important strides in enacting legislation to address violence against women and girls (VAWG). However, significant implementation gaps persist, especially for women and girls facing multiple and intersecting forms of discrimination such as those living with disabilities, adolescent girls, women in rural areas, and women from",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "procurement315@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_008_20250820",
    "title": "INVITATION TO EXPRESS INTEREST",
    "company": "PELUM (Participatory Ecological Land Use Management Association)",
    "description": "SUBJECT: OPEN CALL FOR EXPRESSIONS OF INTEREST FOR CONSTRUCTION OF OFFICE SUPERSTRUCTURE. PELUM Zimbabwe is inviting qualified and experienced construction companies to submit Expressions of Interest (EOI) for the construction of the superstructure of its new office building, located in Mt. Hampden. Scope of Work",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "info@pelumzimbabwe.org",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_009_20250820",
    "title": "Graduate Trainees : SHE, Mining",
    "company": "Jena Mines (Pvt) Ltd",
    "description": "An exciting opportunity to undergo an intensive graduate trainee program has arisen within Jena Mines, and applications are invited from suitably qualified graduates to fill the positions for the following disciplines: SHE x 2 2. Mining x2",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruitment@jenagold.co.zw",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_011_010_20250820",
    "title": "MECHANIC (DIESEL HEAVY VEHICLE)",
    "company": "Turnpick Timbers",
    "description": "We are an established company looking fo a suitably experienced and qualified Diesel Mechanic responsible for the repair and maintance of our fleet of heavy and light vehicles. These include Trucks, Tractors, Graders, Front ends loaders and other vehicles. This will be in a well equiped workshop with frequent field",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr.turnpicktimbers@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_012_001_20250820",
    "title": "Graduate Trainees- Stores",
    "company": "Isteel and Pump Solutions",
    "description": "We are looking for graduate trainees to work in our stores department",
    "category": "Other",
    "sourceSite": "VacancyMail",
    "applyEmail": "hrisp914@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_012_002_20250820",
    "title": "Business Intelligence Manager",
    "company": "Bakers Inn",
    "description": "Superlinx Logistics Pvt Ltd t/a Baker's Inn is seeking a results-driven and visionary BUSINESS INTELLIGENCE MANAGER to lead and centralize data analytics and reporting across its three dynamic business units:",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@bakersinnzim.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_012_003_20250820",
    "title": "Consultancy Opportunity: Development of Terms of Reference for the National Working Group on Child Marriages",
    "company": "N/A",
    "description": "1. Background Child marriage remains a critical issue in Zimbabwe, with approximately 34% of girls married before the age of 18. Despite recent legislative reforms, including the enactment of the Marriages Act (Chapter 5:17), the practice persists due to a combination of socio-economic pressures, cultural and religious beliefs and gaps",
    "category": "NGO & Development",
    "sourceSite": "VacancyMail",
    "applyEmail": "procurement315@gmail.com",
    "closingDate": "Expires 22 Aug 2025"
  },
  {
    "id": "VM_012_004_20250820",
    "title": "Agronomist",
    "company": "N/A",
    "description": "Agronomist Vacancy Notice: 18/8/2025 We're Hiring! Our client, a leading player in the Tobacco Industry is looking for a suitably qualified individual to fill the following position: Agronomist - responsible for working closely with the company's contracted farmers, ensuring they meet production targets, quality standards, and contractual obligations.",
    "category": "Agriculture",
    "sourceSite": "VacancyMail",
    "applyEmail": "ksetoboli@gmail.comno",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_012_005_20250820",
    "title": "Provincial Agronomist",
    "company": "N/A",
    "description": "We are seeking a dedicated Provincial Agronomist to join our team. Reporting to the Operations Director - Commercial Production, the successful applicant will be responsible for the following key duties:",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "recruith.hr2025@gmail.com",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_012_006_20250820",
    "title": "Master Kiln Burners X2",
    "company": "Khayah Cement Limited",
    "description": "An Exciting opportunity has arisen at Khayah Cement for suitably qualified and experienced persons for the above post, which has arisen in the Pyro-Processing (Kiln Production) Department.",
    "category": "Other",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@khayahcement.com",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_012_007_20250820",
    "title": "Accounts Attach",
    "company": "N/A",
    "description": "A local manufacturing company seeks to hire an efficient, well-organized, self-motivated, dynamic, and multi-skilled individual to join our organization in the position listed below. The selected incumbent will be based at our Harare Factory Office. Post: Accounts Attach",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "avacancies5@gmail.com",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_012_008_20250820",
    "title": "Graduate Intern - People & Culture",
    "company": "World Vision",
    "description": "Location: Suburbs Office, Bulawayo x 1 Purpose of the position World Vision Zimbabwe is seeking a passionate and detail-oriented Graduate Intern - People & Culture to support HR operations across grants and program areas. This internship offers hands-on exposure to key HR functions in a fast-paced, purpose-driven environment.",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "zimo_careers@wvi.org",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_012_009_20250820",
    "title": "Temporary Business Analyst",
    "company": "Small and Medium Enterprise Development Corporation SMEDCO",
    "description": "The position exists to handle loan enquiries in the processing of applications and the administration of accounts as representatives of SMEDCO to ensure the implementation of lending facilities to all stakeholders.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "humanresources@smedco.co.zw",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_012_010_20250820",
    "title": "Intern",
    "company": "Small and Medium Enterprise Development Corporation SMEDCO",
    "description": "Applications are invited from suitably qualified and experienced candidates to fill the post: Intern 1 (Harare Branch)",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "humanresources@smedco.co.zw",
    "closingDate": "Expires 21 Aug 2025"
  },
  {
    "id": "VM_013_001_20250820",
    "title": "Finance Intern",
    "company": "The Biotech Institute",
    "description": "The Biotech Institute is seeking a Finance Intern to support day-to-day finance and administration across our laboratories and distribution operations. The role includes processing transactions, reconciliations, credit control support, and assisting with audits and inventory accounting. You'll also handle occasional bank runs and document deliveries-so a valid driver's licence is",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "applications@biotechinst.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_002_20250820",
    "title": "BLOCK FOREMAN x 3",
    "company": "Green Fuel",
    "description": "Applications are invited from suitably qualified individuals to fill the above vacancy that has arisen in the Fields Department,",
    "category": "IT & Technology",
    "sourceSite": "VacancyMail",
    "applyEmail": "energy.mutakaya@greenfuel.co.zw",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_003_20250820",
    "title": "Finance Manager - Property Division",
    "company": "N/A",
    "description": "FINANCE MANAGER - PROPERTY DEVELOPMENT DIVISION JOB SUMMARY Overall Management of the Finance Function for the Real Estate Division",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "realpropertieszim@gmail.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_004_20250820",
    "title": "Accountant",
    "company": "N/A",
    "description": "VACANCY NOTICE - ACCOUNTANT An organisation is seeking to recruit a highly experienced Accountant to join our team.",
    "category": "Finance & Banking",
    "sourceSite": "VacancyMail",
    "applyEmail": "admin@grangecapital.orgCC",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_005_20250820",
    "title": "General Manager - Auctioneering Division",
    "company": "N/A",
    "description": "ANONYMOUS JOB ADVERTISEMENT 1. GENERAL MANAGER - AUCTIONEERING DIVISION JOB SUMMARY Overall Management of Auction Business",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "realpropertieszim@gmail.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_006_20250820",
    "title": "Security Guards",
    "company": "N/A",
    "description": "We are conducting an explosive mass recruitment drive for a minimum of 100 experienced, mature, and highly disciplined proffessional Security Guards to be deployed at a strategic mining environment between Chegutu, Kwekwe Mt Darwin and Harare Regions. This is a serious, high-demand opportunity suited for professionals ready to serve with",
    "category": "Security",
    "sourceSite": "VacancyMail",
    "applyEmail": "vacancies2018@gmail.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_007_20250820",
    "title": "Administrative Assistant",
    "company": "SIS Inspections (Pvt) Ltd",
    "description": "Job Opportunity: Administrative Assistant Company: SIS Inspections (Pvt) Ltd Location: Harare Industry: Inspections Closing Date: 21 August 2025 SIS Inspections (Pvt) Ltd is seeking a proactive and detail-oriented Administrative Assistant to join our growing team. The ideal candidate will provide essential administrative support to ensure the smooth operation of our",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "hr@sisinspections.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_008_20250820",
    "title": "Nurse Aid",
    "company": "The Biotech Institute",
    "description": "The Biotech Institute clinic seeks a Nurse Aide with strong front-of-house etiquette to support our Medical Doctor and keep patient flow smooth. The role blends clinical assistance (within nurse-aide scope under supervision) and reception duties (welcome desk, phones, bookings). Significant prior experience in a clinic/GP setting is essential. Duties are",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "applications@biotechinst.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_009_20250820",
    "title": "Production attachees",
    "company": "Nash Paints",
    "description": "Nash Paints is looking for a Chemical Engineering Attachee to join their organisation as a production attachee",
    "category": "Engineering",
    "sourceSite": "VacancyMail",
    "applyEmail": "N/A",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_013_010_20250820",
    "title": "Legal Secretary / Receptionist",
    "company": "N/A",
    "description": "Vacancy: Legal Secretary / Receptionist A local Law Firm is looking for a young, dynamic individual with a legal background to join their growing legal team.",
    "category": "Administration",
    "sourceSite": "VacancyMail",
    "applyEmail": "legaldepartmentzim@gmail.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_014_001_20250820",
    "title": "General Manager - Auctioneering Division",
    "company": "N/A",
    "description": "ANONYMOUS JOB ADVERTISEMENT 1. GENERAL MANAGER - AUCTIONEERING DIVISION JOB SUMMARY Overall Management of Auction Business",
    "category": "Management",
    "sourceSite": "VacancyMail",
    "applyEmail": "realpropertieszim@gmail.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "VM_014_002_20250820",
    "title": "Nurse Aid",
    "company": "The Biotech Institute",
    "description": "The Biotech Institute clinic seeks a Nurse Aide with strong front-of-house etiquette to support our Medical Doctor and keep patient flow smooth. The role blends clinical assistance (within nurse-aide scope under supervision) and reception duties (welcome desk, phones, bookings). Significant prior experience in a clinic/GP setting is essential. Duties are",
    "category": "Healthcare",
    "sourceSite": "VacancyMail",
    "applyEmail": "applications@biotechinst.com",
    "closingDate": "Expires 20 Aug 2025"
  },
  {
    "id": "JZ_001_001_20250820",
    "title": "CHEF",
    "company": "ROYAL VILLAH LODGE",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 31, 2025"
  },
  {
    "id": "JZ_001_002_20250820",
    "title": "ACCOUNTING OFFICER",
    "company": "Incaptta",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Finance & Banking",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_001_003_20250820",
    "title": "APPRENTICSHIP",
    "company": "Sandvik Zimbabwe",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires September 03, 2025"
  },
  {
    "id": "JZ_001_004_20250820",
    "title": "HUMAN RESOURCES COORDINATOR",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Human Resources",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires September 03, 2025"
  },
  {
    "id": "JZ_001_005_20250820",
    "title": "PROFESSOR/LECTURER",
    "company": "MIDLANDS STATE UNIVERSITY",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Education & Training",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 27, 2025"
  },
  {
    "id": "JZ_001_006_20250820",
    "title": "DIGITAL INTERN",
    "company": "DIAMOND FM",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "IT & Technology",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_001_007_20250820",
    "title": "NEWS INTERN",
    "company": "DIAMOND FM",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_001_008_20250820",
    "title": "OVERSEER MINER",
    "company": "Freda Rebecca Gold Mine",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_001_009_20250820",
    "title": "GRADUATE TRAINEE'S",
    "company": "TANO",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 21, 2025"
  },
  {
    "id": "JZ_001_010_20250820",
    "title": "AML/CFT COMPLIANCE OFFICER",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Legal",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_001_011_20250820",
    "title": "RECORDS MANAGEMENT GRADUATE TRAINEE",
    "company": "ZERA",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_001_012_20250820",
    "title": "FINANCIAL ACCOUNTANT",
    "company": "AFC",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Finance & Banking",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 27, 2025"
  },
  {
    "id": "JZ_001_013_20250820",
    "title": "DIAMOND DRILLER",
    "company": "Freda Rebecca Gold Mine",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_001_014_20250820",
    "title": "SHIFT BOSS",
    "company": "Freda Rebecca Gold Mine",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_001_015_20250820",
    "title": "Sales and Marketing Representative",
    "company": "Full-Time (On-site)",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Sales & Marketing",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_002_001_20250820",
    "title": "Sales Jobs Available in Bulawayo, Harare, Gweru, Mutare, Kwekwe, and Masvingo",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Sales & Marketing",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_002_002_20250820",
    "title": "CHIEF ACCOUNTANT",
    "company": "SACP",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Finance & Banking",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 30, 2025"
  },
  {
    "id": "JZ_002_003_20250820",
    "title": "STOCKS CLERK",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_004_20250820",
    "title": "TAX COMPLIANCE OFFICER",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Legal",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_005_20250820",
    "title": "GENERAL HAND",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_006_20250820",
    "title": "PROCUREMENT GRADUATE TRAINEE",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_007_20250820",
    "title": "ASSISTANT MECHANICAL TECHNICIAN",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_008_20250820",
    "title": "PROJECTS ENGINEER",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Engineering",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_009_20250820",
    "title": "HEALTH, SAFETY AND ENVIRONMENT OFFICER",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Healthcare",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_010_20250820",
    "title": "CHARGEMAN",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_011_20250820",
    "title": "TRAINING OFFICER",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Education & Training",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_002_012_20250820",
    "title": "ENGINEERING CONSULTANT",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Engineering",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 20, 2025"
  },
  {
    "id": "JZ_002_013_20250820",
    "title": "MINE SURVEYOR",
    "company": "ZIMASCO (Pvt) Ltd",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 31, 2025"
  },
  {
    "id": "JZ_002_014_20250820",
    "title": "BUS CONDUCTOR",
    "company": "ZUPCO",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires September 03, 2025"
  },
  {
    "id": "JZ_002_015_20250820",
    "title": "PROCUREMENT MANAGER",
    "company": "Forestry Commission",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires September 05, 2025"
  },
  {
    "id": "JZ_003_001_20250820",
    "title": "HUMAN CAPITAL DEVELOPMENT & ADMINISTRATION MANAGER",
    "company": "Forestry Commission",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "NGO & Development",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires September 05, 2025"
  },
  {
    "id": "JZ_003_002_20250820",
    "title": "ANALYTICAL, RESEARCH AND DEVELOPMENT CHEMIST",
    "company": "ZIMASCO (Pvt) Ltd",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "NGO & Development",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_003_005_20250820",
    "title": "LEARNER SECURITY GUARDS",
    "company": "NATIONAL RAILWAYS OF ZIMBABWE",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Security",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 28, 2025"
  },
  {
    "id": "JZ_003_007_20250820",
    "title": "ICT ASSISTANT",
    "company": "HEAD HUNTERS INTERNATIONAL A MANAGEMENT CONSULTANCY FIRM",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 30, 2025"
  },
  {
    "id": "JZ_003_008_20250820",
    "title": "NARROW REEF MINING ENGINEER",
    "company": "The Gem",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Engineering",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 20, 2025"
  },
  {
    "id": "JZ_003_009_20250820",
    "title": "CLIENT SERVICES CLERK",
    "company": "Doves",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_003_010_20250820",
    "title": "GRADUATE TRAINEE",
    "company": "Jena Mines",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_003_011_20250820",
    "title": "NURSE/AMBULANCE TECHNICIAN",
    "company": "Jena Mines",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Healthcare",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_003_012_20250820",
    "title": "SECURITY OFFICER- TREGER PRODUCTS PVT (LTD)",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Security",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_003_013_20250820",
    "title": "SECURITY MANAGER",
    "company": "TREGER PRODUCTS PVT (LTD)",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Security",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_003_014_20250820",
    "title": "MASTER KILN BURNERS",
    "company": "Khayah",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 21, 2025"
  },
  {
    "id": "JZ_003_015_20250820",
    "title": "GRAPHIC DESIGNER",
    "company": "VGP TECHNOLOGIES",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "IT & Technology",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 30, 2025"
  },
  {
    "id": "JZ_004_002_20250820",
    "title": "SALES/ACCOUNT MANAGER",
    "company": "ProRecruit",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Sales & Marketing",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 28, 2025"
  },
  {
    "id": "JZ_004_004_20250820",
    "title": "SALES OFFICER",
    "company": "Corporate 24 Hospital Group",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Sales & Marketing",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 30, 2025"
  },
  {
    "id": "JZ_004_005_20250820",
    "title": "DIRECTOR AIR NAVIGATION AND TECHNICAL SERVICES",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_004_006_20250820",
    "title": "CREDIT CONTROLLER",
    "company": "Norton Town Council",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Finance & Banking",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_004_007_20250820",
    "title": "AMENITIES SUPERVISOR",
    "company": "Norton Town Council",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 27, 2025"
  },
  {
    "id": "JZ_004_008_20250820",
    "title": "SENIOR ADMINISTRATION ASSISTANT",
    "company": "Norton Town Council",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_004_009_20250820",
    "title": "BUILDING INSPECTOR",
    "company": "MAZOWE DISTRICT COUNCIL",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Other",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 27, 2025"
  },
  {
    "id": "JZ_004_010_20250820",
    "title": "PLANNING TECHNICIAN",
    "company": "MAZOWE DISTRICT COUNCIL",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 27, 2025"
  },
  {
    "id": "JZ_004_011_20250820",
    "title": "CHIEF EXECUTIVE OFFICER",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 27, 2025"
  },
  {
    "id": "JZ_004_012_20250820",
    "title": "ASSISTANT",
    "company": "RURAL ELECTRIFICATION FUND",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 25, 2025"
  },
  {
    "id": "JZ_004_013_20250820",
    "title": "SHEQ MANAGER",
    "company": "UNIVERSITY OF ZIMBABWE",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_005_001_20250820",
    "title": "HOTEL MANAGER",
    "company": "ZHONGJIN INTERNATIONAL HOTEL",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 31, 2025"
  },
  {
    "id": "JZ_005_005_20250820",
    "title": "DIGITAL MAKETING INTERN",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "IT & Technology",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 21, 2025"
  },
  {
    "id": "JZ_005_006_20250820",
    "title": "ACCOUNTANT",
    "company": "GICGL",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Finance & Banking",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 30, 2025"
  },
  {
    "id": "JZ_005_007_20250820",
    "title": "SECURITY GUARD",
    "company": "N/A",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Security",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 20, 2025"
  },
  {
    "id": "JZ_005_010_20250820",
    "title": "SITE SUPERVISOR",
    "company": "UltraBank",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 21, 2025"
  },
  {
    "id": "JZ_005_011_20250820",
    "title": "RECEPTIONIST/PA",
    "company": "UltraBank",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 21, 2025"
  },
  {
    "id": "JZ_008_011_20250820",
    "title": "TOWN CLERK",
    "company": "CITY OF GWERU",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  },
  {
    "id": "JZ_009_003_20250820",
    "title": "IT/ COMPUTER SCIENCE TEACHER",
    "company": "Watershed College",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Education & Training",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires September 01, 2025"
  },
  {
    "id": "JZ_010_004_20250820",
    "title": "DIRECTOR OF HOUSING AND COMMUNITY SERVICES",
    "company": "ZVISHAVANE TOWN COUNCIL",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Management",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 29, 2025"
  },
  {
    "id": "JZ_011_006_20250820",
    "title": "TOWN CLERK",
    "company": "City of Gweru",
    "description": "Job posted on Jobs Zimbabwe. Full details available on website.",
    "category": "Administration",
    "sourceSite": "Jobs Zimbabwe",
    "applyEmail": "Apply on Jobs Zimbabwe",
    "closingDate": "Expires August 22, 2025"
  }
]